export type City = {
    name: string;
    lat: number | null;
    lon: number | null;
};


export const popularCities = [
    { name: 'Москва', lat: 55.755787, lon: 37.617634 },
    { name: 'Санкт-Петербург', lat: 59.77021, lon: 30.344749 },
    { name: 'Новосибирск', lat: 55.03923, lon: 82.927818 },
    { name: 'Екатеринбург', lat: 56.837814, lon: 60.596844 },
    { name: 'Казань', lat: 55.796539, lon: 49.1082 },
    { name: 'Нижний Новгород', lat: 56.329918, lon: 44.009193 },
    { name: 'Красноярск', lat: 56.001251, lon: 92.88559 },
    { name: 'Челябинск', lat: 55.159889, lon: 61.40258 },
    { name: 'Самара', lat: 53.20216, lon: 50.159618 },
    { name: 'Омск', lat: 54.970901, lon: 73.393753 },
    { name: 'Хабаровск', lat: 48.476719, lon: 135.09407 },
    { name: 'Владивосток', lat: 43.130692, lon: 131.923828 },
];